//-----------------------------------------------------------------
// 程序描述:
// 　　芯片外设初始化程序
// 作　　者: 凌智电子
// 开始日期: 2014-01-28
// 完成日期: 2014-01-28
// 修改日期: 2014-02-10
// 当前版本: V1.0
// 历史版本:
// 　- V1.0: 
// 调试工具: 凌智STM32核心开发板、LZE_ST_LINK2，示波器
// 说　　明: 
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "ti_msp_dl_config.h"
#include "Delay.h"
#include "PeripheralInit.h"

//-----------------------------------------------------------------
//    宏定义
//-----------------------------------------------------------------
#define AD9851_wclk_0 DL_GPIO_clearPins(GPIO_AD9851_WCLK_PORT, GPIO_AD9851_WCLK_PIN)
#define AD9851_wclk_1 DL_GPIO_setPins(GPIO_AD9851_WCLK_PORT, GPIO_AD9851_WCLK_PIN)
#define AD9851_fqud_0 DL_GPIO_clearPins(GPIO_AD9851_FQUP_PORT, GPIO_AD9851_FQUP_PIN)
#define AD9851_fqud_1 DL_GPIO_setPins(GPIO_AD9851_FQUP_PORT, GPIO_AD9851_FQUP_PIN)
#define AD9851_D7_0   DL_GPIO_clearPins(GPIO_AD9851_D7_PORT, GPIO_AD9851_D7_PIN)
#define AD9851_D7_1   DL_GPIO_setPins(GPIO_AD9851_D7_PORT, GPIO_AD9851_D7_PIN)
#define AD9851_rset_0 DL_GPIO_clearPins(GPIO_AD9851_RST_PORT, GPIO_AD9851_RST_PIN)
#define AD9851_rset_1 DL_GPIO_setPins(GPIO_AD9851_RST_PORT, GPIO_AD9851_RST_PIN)
 

//-----------------------------------------------------------------
// 函数声明
//-----------------------------------------------------------------
//void Out_Init(void);

//-----------------------------------------------------------------
// 初始化程序区
//-----------------------------------------------------------------
//-----------------------------------------------------------------
// void PeripheralInit(void)
//-----------------------------------------------------------------
// 
// 函数功能: 系统外设初始化
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: Out_Init()
// 注意事项: 无
//-----------------------------------------------------------------
// void PeripheralInit(void)
// {	
// 	Out_Init();                         // 输出初始化
	
// }
//-----------------------------------------------------------------
// void Out_Init(void)
//-----------------------------------------------------------------
//
// 函数功能:对IO口进行配置
// 入口参数: 无
// 返回参数: 无
// 全局变量: 无
// 调用模块: 无
// 注意事项:  
//
//-----------------------------------------------------------------
// void Out_Init(void)
// {
// 	GPIO_InitTypeDef GPIO_InitStructure;
// 	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC  | RCC_APB2Periph_GPIOD/*| RCC_APB2Periph_AFIO*/,ENABLE);		// 开启GPIOE时钟
	
// 	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_10 |  GPIO_Pin_14 ;
// 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;				// 设置为推挽输出
// 	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;				// 时钟50MHz
// 	GPIO_Init(GPIOD,&GPIO_InitStructure);
//   GPIO_ResetBits(GPIOD,GPIO_Pin_8|GPIO_Pin_10|GPIO_Pin_14);
	
// 	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3| GPIO_Pin_4| GPIO_Pin_5| GPIO_Pin_6| GPIO_Pin_7 ;
// 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;				// 设置为推挽输出
// 	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;				// 时钟50MHz
// 	GPIO_Init(GPIOC,&GPIO_InitStructure);
// 	GPIO_ResetBits(GPIOC,GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3| GPIO_Pin_4| GPIO_Pin_5| GPIO_Pin_6| GPIO_Pin_7);

	
// }

//-----------------------------------------------------------------------------
//void AD9851_reset()
//-----------------------------------------------------------------------------
//
// 函数功能:      AD9851初始化（并行模式输出）
// 入口参数:      无
// 出口参数:      无
// 全局变量引用:  AD9851_wclk_1,AAD9851_wclk_0,AD9851_fqud_1,AD9851_fqud_0,AD9851_rset_0,AD9851_rset_1;
// 调用模块:      无 
//-----------------------------------------------------------------------------
// void AD9851_reset()
// {
//     AD9851_wclk_0;
//     AD9851_fqud_0;
//     //rset信号
//     AD9851_rset_0;
//     AD9851_rset_1;
//     AD9851_rset_0;
// }

//-----------------------------------------------------------------------------
//void AD9851_wr_parrel(unsigned char w0,double f)
//-----------------------------------------------------------------------------
//
// 函数功能:      AD9851数据输出（并行模式输出）
// 入口参数:      w0，f
// 出口参数:      无
// 全局变量引用:  AD9851_wclk_1,AAD9851_wclk_0,AD9851_fqud_1,AD9851_fqud_0;
// 调用模块:      无 
//-----------------------------------------------------------------------------
// void AD9851_wr_parrel(unsigned char w0,double f)
// {
// 		unsigned char w;
// 		long int y;
// 		y=(long int)((0xffffffff*f)/178000000);	  //32位频率控制字计算
	
// 		//写w0数据
// 		w=w0& 0xffff;  	
// 		GPIOC->ODR=w;      //w0
//  		AD9851_wclk_1;
//  		AD9851_wclk_0;

// 	//写w1数据
// 		w=(y>>24)& 0xffff;	
// 		GPIOC->ODR=w;      //w1
// 	  AD9851_wclk_1;
//  		AD9851_wclk_0;

// 	//写w2数据
// 		w=(y>>16)& 0xffff;	
// 		GPIOC->ODR=w;      //w2
//  		AD9851_wclk_1;
//  		AD9851_wclk_0;
		
// 		//写w3数据
// 		w=(y>>8)& 0xffff;
// 		GPIOC->ODR=w;      //w3
//  		AD9851_wclk_1;
// 		AD9851_wclk_0;
		
// 		//写w4数据
// 		w=(y>>=0)& 0xffff;	
// 		GPIOC->ODR=w;      //w4
//  		AD9851_wclk_1;
// 		AD9851_wclk_0;
// 		//移入始能
// 	  AD9851_fqud_1;
// 		AD9851_fqud_0;
// }

//-----------------------------------------------------------------------------
//void AD9851_reset1()
//-----------------------------------------------------------------------------
//
// 函数功能:      AD9851初始化（串行模式输出）
// 入口参数:      无
// 出口参数:      无
// 全局变量引用:  AD9851_wclk_1,AD9851_wclk_0,AD9851_fqud_1,AD9851_fqud_0,AD9851_rset_0,AD9851_rset_1;
// 调用模块:      无 
//-----------------------------------------------------------------------------
void AD9851_reset1()
{

	AD9851_wclk_0;
    AD9851_fqud_0;
		//AD9851_rset信号
	AD9851_rset_0;
    AD9851_rset_1;
    delay_us(10);
	AD9851_rset_0;
		//AD9851_wclk信号
	AD9851_wclk_0;
	AD9851_wclk_1;
	delay_us(10);
	AD9851_wclk_0;
  //AD9851_fqud信号
	AD9851_fqud_0;
    AD9851_fqud_1;
	delay_us(10);
	AD9851_fqud_0;
}

//-----------------------------------------------------------------------------
//void AD9851_wr_parrel2(unsigned char w0,double f)
//-----------------------------------------------------------------------------
//
// 函数功能:      AD9851数据输出（串行模式输出）
// 入口参数:      w0，f
// 出口参数:      无
// 全局变量引用:  AD9851_wclk_1,AAD9851_wclk_0,AD9851_fqud_1,AD9851_fqud_0;
// 调用模块:      无 
//-----------------------------------------------------------------------------
void AD9851_wr_parrel2(unsigned char w0,double f)
{
	unsigned char i,w;
	long int y;
	y=(long int)((0xffffffff*f)/178000000);	  //32位频率控制字计算
		
	//写w4数据
	//---------------------------------------------------
	w=(y>>=0);
	for(i=0;i<8;i++)
	{
		if(((w>>i)&0x01)==0x01)
		{
            AD9851_D7_1;
        }
		else
		{
            AD9851_D7_0;
        }
		AD9851_wclk_1;
 		AD9851_wclk_0;
		
	}	
	//---------------------------------------------------

	//写w3数据
	//---------------------------------------------------
	w=(y>>8);
	for(i=0;i<8;i++)
	{
		if(((w>>i)&0x01)==0x01)
		{
            AD9851_D7_1;
        }
		else
		{
            AD9851_D7_0;
        }
		AD9851_wclk_1;
 		AD9851_wclk_0;
	}
	//---------------------------------------------------

	//写w2数据
	//---------------------------------------------------
	w=(y>>16);
	for(i=0;i<8;i++)
	{
		if(((w>>i)&0x01)==0x01)
		{
            AD9851_D7_1;
        }
		else
		{
            AD9851_D7_0;
        }
		AD9851_wclk_1;
 		AD9851_wclk_0;
	}
	//---------------------------------------------------

	//写w1数据
	//---------------------------------------------------
	w=(y>>24);
	for(i=0;i<8;i++)
	{
		if(((w>>i)&0x01)==0x01)
		{
            AD9851_D7_1;
        }
		else
		{
            AD9851_D7_0;
        }
		AD9851_wclk_1;
 		AD9851_wclk_0;
	}
	//---------------------------------------------------

	//写w0数据
	//---------------------------------------------------
	w=w0;   
	for(i=0;i<8;i++)
	{
		if(((w>>i)&0x01)==0x01)
		{
            AD9851_D7_1;
        }
		else
		{
            AD9851_D7_0;
        }
		AD9851_wclk_1;
 		AD9851_wclk_0;
	}
	//---------------------------------------------------
 
	//移入始能
	//---------------------------------------------------
    AD9851_fqud_1;
	AD9851_fqud_0;
	//---------------------------------------------------
}

