//-----------------------------------------------------------------
// 芯片外设初始化头文件
// 头文件名: PeripheralInit.h
// 作    者: 凌智电子
// 编写时间: 2014-01-28
// 修改日期:
// 当前版本: V1.0
// 历史版本:
//-----------------------------------------------------------------

#ifndef _PeripheralInit_H
#define _PeripheralInit_H

//-----------------------------------------------------------------
// 外部函数声明 
//-----------------------------------------------------------------
//extern void PeripheralInit(void);
//extern void AD9851_reset(void);
void AD9851_reset1(void);
void AD9851_wr_parrel2(unsigned char w0,double f);
#endif

//-----------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------
